---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitNoIntersection
source: html/6ec0630c-b023-82d0-69c7-0bf869911d04.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitNoIntersection Property

The splitting boundary must divide the Surface into separate pieces. There may be a gap in the splitting Lines or the Sketch may be incomplete.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceSplitNoIntersection { get; }
```